export const tutorials = [
  {
    title: "그래프 선택",
    description:
      "이 데이터는 농업지대의 월별 강수량 데이터입니다. 이 데이터를 나타낼 그래프를 선택해보세요",
  },
  {
    title: "그래프 선택",
    description:
      "시간에 따른 자료의 추세를 나타내기에 적합한 그래프는 꺾은선 그래프로, 데이터를 이용해 농업지대의 월별 강수량의 변화를 나타내려면 꺾은선 그래프를 선택해주세요.",
  },
  {
    title: "각 변수의 특성 선택",
    description:
      "Categorical 변수는 한정된 수의 값을 가질 수 있는 변수이고, numeric 변수는 측정 가능한 양적 정보를 숫자를 통해 나타낸 것입니다. 여기서 ‘월’ 변수는 1월부터 12월까지의 한정된 수의 값을 가질 수 있는 Categorical 변수가 되고, '강수량＇은 강수량이라는 양적 정보를 숫자로 나타낸 것이므로 Numeric 변수입니다.",
  },
  {
    title: "각 축에 해당하는 변수 선택",
    description:
      "꺾은선 그래프를 이용하여 시간에 따른 데이터의 변화를 알고자 한다면 x축에는 시간에 해당하는 변수가, y축에는 시간에 따라 어떻게 변하는지 알고싶은 변수가 들어가는 것이 적절합니다",
  },
  {
    title: "데이터의 범위 설정",
    description:
      "Table 의 데이터를 보며 Y축에 나타날 데이터의 최소값과 최대값을 적절하게 설정해주세요.",
  },
  {
    title: "Y축의 범위를 나타낼 적절한 최대값과 최소값을 생각해보세요",
    description:
      "데이터를 보니 데이터의 최소값이 6.5이고, 최대값이 19.7 입니다. Y축 범위의 최소값과 최대값으로 적절한 값은 정해져 있지는 않지만 모든 데이터를 나타낼 수 있어야 하기 때문에 Y축의 최소값은 데이터의 최소값인 6.5와 같거나 작은 값이어야 하고, Y축의 최대값은 데이터의 최대값인 19.7과 같거나 큰 값이어야 하며, 데이터의 분포가 적절하게 보이도록 설정해야 합니다.",
  },
  {
    title: "적절한 최대값과 최소값을 생각해보세요",
    description:
      "범위를 조정해가면서 데이터의 분포가 목적에 맞게 가장 잘 나타나는 Y축의 최소값과 최대값을 정해보세요",
  },
  {
    title: "적절한 축 간격 설정",
    description: "데이터를 보고 적절한 축 간격을 설정해주세요.",
  },
  {
    title: "범례, 레이블 위치 설정",
    description: "원하는 범례와 레이블의 위치를 골라주세요",
  },
  {
    title: "그래프 평가하기",
    description: "그래프가 완성되었다면 평가하기 버튼을 눌러주세요",
  },
  {
    title: "그래프 목적 설명하기",
    description:
      "그래프가 목적에 맞게 그려졌는지 평가해보고, 그 이유에 대해 적어주세요",
  },
  {
    title: "그래프에 대한 알 수 있는 정보",
    description: "그래프를 보고 알 수 있는 점들에 대해서 적어주세요",
  },
  {
    title: "다음으로",
    description:
      "다 적었다면 다음 버튼을 눌러 연구진이 만든 그래프 정보와 내가 만든 그래프를 비교해보고, 결과보고서 보기 버튼을 눌러 결과보고서를 확인해보세요",
  },
];
