export const tutorials = [
  {
    title: "그래프 선택",
    description:
      "이 데이터는 농업지대의 월별 강수량 데이터입니다. 이 데이터를 나타낼 그래프를 선택해보세요",
  },
  {
    title: "그래프 선택",
    description:
      "시간에 따른 자료의 추세를 나타내기에 적합한 그래프는 꺾은선 그래프로, 데이터를 이용해 농업지대의 월별 강수량의 변화를 나타내려면 꺾은선 그래프를 선택해주세요.",
  },
  {
    title: "먼저 각 변수의 특성을 지정해주세요.",
    description:
      "여기서 ‘월’ 변수는 숫자로 표현되었지만 서로 구분되는 범주로 Categorical 변수이고, '강수량＇은 숫자로 표현되며 서로 대소비교가 가능하기 때문에 ‘Numeric’ 변수 입니다.",
  },
  {
    title: "각 축에 해당하는 변수를 골라주세요.",
    description:
      "꺾은선 그래프를 이용하여 시간에 따른 데이터의 변화를 알고자 한다면 x축에는 시간에 해당하는 변수가, y축에는 시간에 따라 변하는 변수가 들어가는 것이 적절합니다",
  },
  {
    title: "데이터의 범위 설정",
    description:
      "Table 의 데이터를 보며 Y축에 나타날 데이터의 최소값과 최대값을 적절하게 설정해주세요.",
  },
  {
    title: "Y축의 범위를 나타낼 적절한 최대값과 최소값을 생각해보세요",
    description:
      "데이터를 보니 데이터의 최소값이 6.5이고, 최대값이 19.7 입니다. Y축 범위의 최소값과 최대값으로 적절한 값은 정해져 있지는 않지만 모든 데이터를 나타낼 수 있어야 하기 때문에 Y축의 최소값은 데이터의 최소값인 6.5와 같거나 작은 값이어야 하고, Y축의 최대값은 데이터의 최대값인 19.7과 같거나 큰 값이어야 하며, 데이터의 분포가 적절하게 보이도록 설정해야 합니다.",
  },
  {
    title: "적절한 최대값과 최소값을 생각해보세요",
    description:
      "범위를 조정해가면서 데이터의 분포가 목적에 맞게 가장 잘 나타나는 Y축의 최소값과 최대값을 정해보세요",
  },
  {
    title: "적절한 축 간격 설정",
    description: "데이터를 보고 적절한 축 간격을 설정해주세요.",
  },
  {
    title: "범례, 레이블 위치 설정",
    description: "원하는 범례와 레이블의 위치를 골라주세요",
  },
  {
    title: "그래프 평가하기",
    description: "그래프가 완성되었다면 평가하기 버튼을 눌러주세요",
  },
  {
    title:
      "그래프 목적에 맞게 그려졌는지 평가해보고, 그 이유에 대해 적어주세요.",
    description:
      "예시: 월별 강수량의 변화를 보는것이 목적이었는데, 꺾은선으로 시간에 따른 강수량의 변화를 한눈에 알 수 있어 목적에 맞게 잘 그려졌습니다.",
  },
  {
    title: "그래프를 보고 알 수 있는 점들에 대해서 적어주세요",
    description: "예시: 8월에 강수량이 가장 높고, 5월에 가장 낮다.",
  },
  {
    title: "다음으로",
    description:
      "다 적었다면 다음 버튼을 눌러 연구진이 만든 그래프 정보와 내가 만든 그래프를 비교해보고, 결과보고서 보기 버튼을 눌러 결과보고서를 확인해보세요",
  },
];

export const tutorials2 = [
  {
    title: "그래프 선택",
    description:
      "이 데이터는 2023년 8월 11일 도시별 평균기온 데이터 입니다. 이 데이터를 나타낼 그래프를 선택해보세요",
  },
  {
    title: "그래프 선택",
    description:
      "2023년 8월 11일 도시별 기온을 나타내는 데이터로, 도시별로 8월 11일 평균기온을 비교하고자 할 때에는 막대그래프로 나타내는 것이 가장 적절합니다. 막대그래프는 각 도시의 평균기온을 막대의 높이로 나타내어 도시간의 평균기온 비교를 용이하게 합니다.",
  },
  {
    title: "먼저 각 변수의 특성을 지정해주세요.",
    description:
      "‘도시’는 서울, 부산 등의 서로 구분되는 범주로 Categorical 변수가 되고, ‘기온＇은 숫자로 표현되고 서로 대소비교가 가능하므로  Nemeric 변수입니다.",
  },
  {
    title: "각 축에 해당하는 변수를 골라주세요.",
    description:
      "막대그래프를 이용하여 도시별 평균기온의 분포를 알고자 한다면 x축에는 도시가, y축에는 평균기온이 나타나는 것이 적절합니다.",
  },
  {
    title: "데이터의 범위 설정",
    description:
      "Table 의 데이터를 보며 Y축에 나타날 데이터의 최소값과 최대값을 적절하게 설정해주세요.",
  },
  {
    title: "Y축의 범위를 나타낼 적절한 최대값과 최소값을 생각해보세요",
    description: `데이터를 보니 데이터의 최소값이 22.4이고, 최대값이 30.2 입니다. Y축 범위의 최소값과 최대값으로 적절한 값은 정해져 있지는 않지만. 모든 데이터를 나타낼 수 있어야 하기 때문에 Y축의 최소값은 데이터의 최소값인 22.4와 같거나 작은 값이어야 하고,Y축의 최대값은 데이터의 최대값인 30.2와 같거나 큰 값이어야 하며,데이터의 분포가 적절하게 보이도록 설정해야 합니다.위의 조건하에서 Y축의 최대값과 최소값을 조절해가며 가장 목적에 맞는 범위를 정해주세요
      `,
  },
  {
    title: "적절한 최대값과 최소값을 생각해보세요",
    description:
      "범위를 조정해가면서 데이터의 분포가 목적에 맞게 가장 잘 나타나는 Y축의 최소값과 최대값을 정해보세요",
  },
  {
    title: "적절한 축 간격 설정",
    description: "데이터를 보고 적절한 축 간격을 설정해주세요.",
  },
  {
    title: "범례, 레이블 위치 설정",
    description: "원하는 범례와 레이블의 위치를 골라주세요",
  },
  {
    title: "그래프 평가하기",
    description: "그래프가 완성되었다면 평가하기 버튼을 눌러주세요",
  },
  {
    title:
      "그래프 목적에 맞게 그려졌는지 평가해보고, 그 이유에 대해 적어주세요.",
    description:
      "예시: 도시별 평균기온의 비교를 목적으로 그래프를 그렸는데, 어느 지역이 평균기온이 높고 낮은지를 한눈에 볼 수 있어 목적에 맞게 그려졌습니다.",
  },
  {
    title: "그래프를 보고 알 수 있는 점들에 대해서 적어주세요",
    description: "예시: 제주도의 평균기온이 가장 높다",
  },
  {
    title: "다음으로",
    description:
      "다 적었다면 다음 버튼을 눌러 연구진이 만든 그래프 정보와 내가 만든 그래프를 비교해보고, 결과보고서 보기 버튼을 눌러 결과보고서를 확인해보세요",
  },
];

export const tutorials3 = [
  {
    title: "그래프 선택",
    description:
      "이 데이터는  기상상태별 대중교통의 이용인원을 지역별로 나타낸 데이터입니다. 이 데이터를 나타낼 그래프를 선택해보세요",
  },
  {
    title: "그래프 선택",
    description:
      "맑은 날, 강우, 강설에 따른 각 지역의 대중교통 이용 인원을 나타내려면 다중 막대그래프가 가장 적합합니다. 다중막대그래프는 한 그룹에 속한 여러 변수를 모두 나타낼 때 사용되는 막대그래프로 막대와 꺾은선의 혼합그래프를 선택해주세요",
  },
  {
    title: "먼저 각 변수의 특성을 지정해주세요.",
    description:
      "‘지역’은 서울, 부산 등의 서로 구분되는 범주로 Categorical 변수가 되고, ‘맑은날’,’강우’,’강설’은 숫자로 표현되고 서로 대소비교가 가능하므로  Nemeric 변수입니다.",
  },
  {
    title: "각 축에 해당하는 변수를 골라주세요.",
    description:
      "막대그래프를 이용하여 기상상태에 따른 도시별 대중교통의 인원을 알고자 한다면 x축에는 도시가, y축에는 이용인원이 나타나는 것이 적절합니다. 이때 이용인원은 단위가 ’명’으로 모두 같으므로 맑은날과 강우, 강설은 모두 y1축으로 설정해줍니다.",
  },
  {
    title: "그래프의 형태를 선택해주세요.",
    description:
      "맑은날, 강우, 강설 변인을 각각 막대로 나타낼 수 있고, 꺾은선으로도 나타낼 수 있는데 다중 막대그래프로 나타내기 위해서는 세개 모두 Bar을 선택해주세요",
  },
  {
    title: "데이터의 범위를 설정해주세요",
    description:
      "Table 의 데이터를 보며 Y축에 나타날 데이터의 최소값과 최대값을 적절하게 설정해주세요.",
  },
  {
    title: "Y축의 범위를 나타낼 적절한 최대값과 최소값을 생각해보세요",
    description: `데이터를 보니 데이터의 최소값이 24249이고, 최대값이 3493041 입니다. Y축 범위의 최소값과 최대값으로 적절한 값은 정해져 있지는 않지만. 모든 데이터를 나타낼 수 있어야 하기 때문에 Y축의 최소값은 데이터의 최소값인 24249와 같거나 작은 값이어야 하고, Y축의 최대값은 데이터의 최대값인 3493041과 같거나 큰 값이어야 하며, 데이터의 분포가 적절하게 보이도록 설정해야 합니다. 위의 조건하에서 Y축의 최대값과 최소값을 조절해가며 가장 목적에 맞는 범위를 정해주세요 `,
  },
  {
    title: "적절한 최대값과 최소값을 생각해보세요",
    description:
      "범위를 조정해가면서 데이터의 분포가 목적에 맞게 가장 잘 나타나는 Y1축의 최소값과 최대값과 간격을 정해보세요",
  },
  {
    title: "적절한 최대값과 최소값을 생각해보세요",
    description:
      "범위를 조정해가면서 데이터의 분포가 목적에 맞게 가장 잘 나타나는 Y2축의 최소값과 최대값과 간격을 정해보세요",
  },
  {
    title: "범례, 레이블 위치 설정",
    description: "원하는 범례와 레이블의 위치를 골라주세요",
  },
  {
    title: "그래프 평가하기",
    description: "그래프가 완성되었다면 평가하기 버튼을 눌러주세요",
  },
  {
    title:
      "그래프 목적에 맞게 그려졌는지 평가해보고, 그 이유에 대해 적어주세요.",
    description:
      "예시: 기상상태에 따라 대중교통 이용 인원이 달라지는지 알고싶어 그래프로 나타냈는데, 기상상태에 따른 대중교통 이용 인원의 분포를 한눈에 볼 수 있어 목적에 맞게 그려졌다고 생각합니다.",
  },
  {
    title: "그래프를 보고 알 수 있는 점들에 대해서 적어주세요",
    description:
      "예시: 서울의 대중교통 이용인원이 제일 많다 거의 모든 지역에서 맑은날일때 대중교통 이용인원이 제일 많고, 강설일때가 제일 적다.",
  },
  {
    title: "다음으로",
    description:
      "다 적었다면 다음 버튼을 눌러 연구진이 만든 그래프 정보와 내가 만든 그래프를 비교해보고, 결과보고서 보기 버튼을 눌러 결과보고서를 확인해보세요",
  },
];
